In [7]:
import numpy as np
import pandas as pd
import math
from sklearn import metrics

from scipy.stats import entropy

import warnings
warnings.filterwarnings("ignore")
import matplotlib.pyplot as plt
import matplotlib.dates as mdates #to format dates on our plots
%matplotlib inline
import seaborn as sns
import acquire
from acquire import get_codeup_data
from acquire import get_cohort_data
from prepare import prep_codeup_data
from prepare import prep_cohort_data

# Goal of this project is to answer a set of questions regarding the Codeup dataset that will be delivered to Maggie via email, which she will use as part of a presentation in a board meeting.

-------------------------------------------------------------

# Acquire

**First thing is to acquire the data from the acquire.py file**

In [2]:
df = get_codeup_data()

In [3]:
df.head()

,0,1,2,3,4,5
0,2018-01-26,09:55:03,/,1,8.0,97.105.19.61
1,2018-01-26,09:56:02,java-ii,1,8.0,97.105.19.61
2,2018-01-26,09:56:05,java-ii/object-oriented-programming,1,8.0,97.105.19.61
3,2018-01-26,09:56:06,slides/object_oriented_programming,1,8.0,97.105.19.61
4,2018-01-26,09:56:24,javascript-i/conditionals,2,22.0,97.105.19.61

**Acquiring the cohort dataset in order to join with codeup dataset, matching the cohort name with the id**

In [4]:
cohort = get_cohort_data()

In [5]:
cohort.head()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6
0,NaN,cohort_id,name,start_date,end_date,program_id,NaN
1,NaN,1,Arches,2014-02-04,2014-04-22,1,NaN
2,NaN,2,Badlands,2014-06-04,2014-08-22,1,NaN
3,NaN,3,Carlsbad,2014-09-04,2014-11-05,1,NaN
4,NaN,4,Denali,2014-10-20,2015-01-18,1,NaN

# Prepare

**Cleaning the cohort data by renaming columns and changing the cohort id to an integer**

In [8]:
cohort = prep_cohort_data(cohort)

In [9]:
cohort.head()

0  cohort_id        name  start_date    end_date
1          1      Arches  2014-02-04  2014-04-22
2          2    Badlands  2014-06-04  2014-08-22
3          3    Carlsbad  2014-09-04  2014-11-05
4          4      Denali  2014-10-20  2015-01-18
5          5  Everglades  2014-11-18  2015-02-24

**Running the main prep function to clean up the primary dataset. This will rename the columns, merge the two dataframes together, change the date to datetime and set the date as the index**

In [10]:
df = prep_codeup_data(df, cohort)

In [11]:
df.head()

,page_viewed,user_id,cohort_id,ip,name,start_date,end_date
date,,,,,,,
2018-01-26 09:55:03,/,1,8,97.105.19.61,Hampton,2015-09-22,2016-02-06
2018-01-26 09:56:02,java-ii,1,8,97.105.19.61,Hampton,2015-09-22,2016-02-06
2018-01-26 09:56:05,java-ii/object-oriented-programming,1,8,97.105.19.61,Hampton,2015-09-22,2016-02-06
2018-01-26 09:56:06,slides/object_oriented_programming,1,8,97.105.19.61,Hampton,2015-09-22,2016-02-06
2018-01-26 10:40:15,javascript-i/functions,1,8,97.105.19.61,Hampton,2015-09-22,2016-02-06